#!/usr/bin/env python3
# -*- coding: utf8 -*-
# 定义错误值范围
#   系统错误: 3000 - 3300
#   系统错误扩展 : 3800 - 4000
#   数据缺失: 4000 - 4400
#   数据处理问题: 4400 - 4500
#   接口请求错误: 4500 - 4550
#   系统接口错误: 4550 - 4600
#   认证相关: 4700 - 4800


CODEMAPPING = {
    '-1': '自定义错误',
    '2000': 'success',
    '3000': 'System Error',
    '4001': '异常数据',
    '4400': '数据处理错误',
    '4401': '数据重复保存',
    '4450': '文件上传失败',
    '4460': '文件格式错误',
    '4461': '文件数据异常',
    '4470': '文件下载失败',
    '4471': '文件下载被禁止',
    '4500': '非法请求',
    '4501': '请求参数数据缺失',
    '4502': '请求参数数据异常',
    '4600': '无访问权限',
    '4700': '异常用户',
    '4701': '用户名/手机号/身份证号重复',
    '4702': '权限不足，请联系管理员操作',
    '4703': '非法名称',
    '4704': '请输入正确的身份证号',
    '4705': '暂不支持非大陆身份证号',
    '4710': '新旧密码不能相同',
    '4711': '用户名/密码错误',
    '4712': '验证码失效',
    '4713': '验证码错误',
    '4714': "密码复杂度过低，要求: 8~24个字符，同时包含大小写字母、数字、特殊字符（()`!@#$%^&*_-+=|{}[]:;'<>,.?）",
    '4715': "非法登陆名，要求: 5~24个字符，26个英文字母、数字、特殊字符（_-.@）同时特殊字符数量不能超过总数的1/3",
    '4720': '账号未激活，请联系管理员进行激活。',
    '4721': '账号未登录或已登录过期',
    '4722': '请使用平台账号登录'
}

ERROR_INFO = {
    "ValueError": ("4400", "传入无效的参数"),
    "TypeError": ("4400", "对类型无效的操作"),
    "AttributeError": ("4400", "对象没有这个属性"),
    "KeyError": ("4400", "映射中没有这个键"),
    "sqlalchemy.exc.DataError": ("4601", "由于被处理数据的问题(如除零、数值超出范围等)而引起的错误引发异常"),
    "sqlalchemy.exc.OperationalError": ("4602", "PSQL 服务器意外关闭连接"),
    "sqlalchemy.exc.AmbiguousForeignKeysError": ("4601", "在联接期间两个可选择项之间可以找到多个外键匹配时引发"),
    "sqlalchemy.exc.ArgumentError": ("4601", "在提供无效或冲突的函数参数时引发"),
    "sqlalchemy.exc.IntegrityError": ("4601", "数据库写入数据错误"),
    "sqlalchemy.exc.ProgrammingError": ("4601", "编程错误"),
}
